Revit 2027 API
View.GetReferenceElevations Method
 Returns element ids of all reference elevations in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetReferenceElevations()
Public Function GetReferenceElevations As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetReferenceElevations()
member GetReferenceElevations : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Element ids of all reference elevations in the view.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace